In [1]:
import psycopg2
import pandas as pd

In [2]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
)

In [19]:

query_vacancies = f'''select *
           from vacancies
           limit {3}
        '''

In [20]:
df = pd.read_sql_query(query_vacancies, connection)
df

/tmp/ipykernel_79959/357088677.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_vacancies, connection)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,None,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,None,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,None,160,69961

In [21]:

query_areas = f'''select *
           from areas
           limit {3}
        '''
        
df = pd.read_sql_query(query_areas, connection)
df

/tmp/ipykernel_79959/1994843379.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_areas, connection)

     id      name
0  2758   Тбилиси
1     8    Майкоп
2  1180  Нерюнгри

In [22]:
query_employers = f'''select *
           from employers
           limit {3}
        '''
        
df = pd.read_sql_query(query_employers, connection)
df

/tmp/ipykernel_79959/1875865012.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_employers, connection)

      id                                               name  area
0   2393                   Программный Продукт, ИТ-компания     1
1  72977                                          БАРС Груп    88
2   3155  Бест, Торгово-производственная компания, Екате...     3

In [23]:
query_industries = f'''select *
           from industries
           limit {3}
        '''
        
df = pd.read_sql_query(query_industries, connection)
df

/tmp/ipykernel_79959/3565160343.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_industries, connection)

       id                                               name
0   7.540                Разработка программного обеспечения
1   7.539  Системная интеграция,  автоматизации технологи...
2  27.550              Безалкогольные напитки (производство)

In [24]:
query_employers_industries = f'''select *
           from employers_industries
           limit {3}
        '''
        
df = pd.read_sql_query(query_employers_industries, connection)
df

/tmp/ipykernel_79959/3169875918.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_employers_industries, connection)

   employer_id industry_id
0         2393       7.540
1         2393       7.539
2        72977       7.540